views/catalog/index.php

    <?php // echo $this->render('_search', ['model' => $searchModel]); ?>

<?php
$rows = (new Query())
    ->select(['auto.id', 'auto.category_id', 'auto.marka_id', 'auto.name', 'auto.content', 'auto.date', 'category.name as category_name', 'marka.name as marka_name', 'auto_id', 'attribute_id', 'value', 'attribute.id as id_attribute', 'attribute.name as attribute_name'])
    ->from('auto')
    ->join('LEFT JOIN', 'value', 'auto.id = auto_id')
    ->join('LEFT JOIN',  'category', 'category_id = category.id')
    ->join('LEFT JOIN', 'marka', 'marka_id = marka.id')
    ->join('LEFT JOIN', 'attribute', 'attribute.id = attribute_id')
    ->all();
---
SELECT `auto`.`id`, `auto`.`category_id`, `auto`.`marka_id`, `auto`.`name`, `auto`.`content`, `auto`.`date`, `category`.`name` AS `category_name`, `marka`.`name` AS `marka_name`, `auto_id`, `attribute_id`, `value`, `attribute`.`id` AS `id_attribute`, `attribute`.`name` AS `attribute_name` FROM `auto` LEFT JOIN `value` ON auto.id = auto_id LEFT JOIN `category` ON category_id = category.id LEFT JOIN `marka` ON marka_id = marka.id LEFT JOIN `attribute` ON attribute.id = attribute_id