controllers/admin/ValuesController.php

INSERT INTO `value` (`auto_id`, `attribute_id`, `value`) VALUES (18, 1, 'Красный')
---
    public function actionCreate()
    {
        $model = new Value();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {