views/admin/values/_form.php


    <?= $form->field($model, 'auto_id')->hiddenInput(['value'=>$_GET['auto_id']])?>

    <?= $form->field($model, 'attribute_id')->dropDownList(Attribute::find()->select(['name','id'])->indexBy('id')->column(), ['prompt' => '']) ?>
---
SELECT `name`, `id` FROM `attribute`