views/admin/autos/_form.php

SELECT `name`, `id` FROM `category`
SELECT `name`, `id` FROM `marka`
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'category_id')->dropDownList(Category::find()->select(['name','id'])->indexBy('id')->column(), ['prompt' => '']) ?>

    <?= $form->field($model, 'marka_id')->dropDownList(Marka::find()->select(['name','id'])->indexBy('id')->column(), ['prompt' => '']) ?>