views/admin/autos/index.php


            [
                'attribute' => 'category_id',
                'filter' => Category::find()->select(['name', 'id'])->indexBy('id')->column(),
---
SELECT `name`, `id` FROM `category`

            ],
            [
                'attribute' => 'marka_id',
                'filter' => Marka::find()->select(['name', 'id'])->indexBy('id')->column(),
---
SELECT `name`, `id` FROM `marka`